<a href="https://colab.research.google.com/github/DenMantm/colab/blob/main/examples%5CM1_2_7_Slight_detour__Making_sense_of__describe().ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Slight detour: Making sense of `.describe()`

One of our old pandas friends is `.describe()`. It describes some mathematical stuff about a data set.

In [ ]:
import pandas as pd
df=pd.DataFrame([
                 {'name':'Smushface', 'salary':1200},
                 {'name':'Jen', 'salary':25000},
                 {'name':'James', 'salary':55000},
                 {'name':'John', 'salary':35000},
                 {'name':'Josephine', 'salary':25000},
                 {'name':'Jacques', 'salary':15000},
                 {'name':'Bill Gates', 'salary':100000}])
df.head()

        name  salary
0  Smushface    1200
1        Jen   25000
2      James   55000
3       John   35000
4  Josephine   25000

In [ ]:
# Make it so we only have three decimal places
pd.set_option('display.float_format', lambda x: '%.3f' % x)
df.describe()

          salary
count      7.000
mean   36600.000
std    32530.806
min     1200.000
25%    20000.000
50%    25000.000
75%    45000.000
max   100000.000

And you see the mean displayed in all its glory, and so you scream, **it doesn't include the median**

But it does! Really! Give it a look around and see if you can find it.

Yes, that's right - **50% is the median**. Half of the values are above, and half are below. The 25% and 75% are similar meaures:

* 25%, a.k.a. **Q1**, a.k.a. **the first quartile** has 25% of the values below it and 75% above it.
* 75%, a.k.a. **Q3**, a.k.a. **the third quartile** has 75% of the values below it and 25% below it.
* and, of course, 50% is also known as **Q2**.

25% can be thought of as the median of the bottom half of the data, and 75% can describe the median of the top half of the data. They give you a sense of **the range of data**.

Ok, let's go back to the FutureLearn platform.